% задаем кластер №1 
y1=0.5+rand(1,30); 
x1=-0.5+rand(1,30); 
% задаем кластер №2 
y2=-1.5+rand(1,30); 
x2=0.5+rand(1,30); 
% задаем кластер №3 
y3=-1.5+rand(1,30); 
x3=-1.5+rand(1,30); 
% задаем кластер №4 
x4=-4.5+rand(1,30); 
y4=3.5+rand(1,30); 
% Отображаем данные на figure (1) 
figure (1); 
hold on; 
plot(x1,y1,'og'); 
plot(x2,y2,'oy'); 
plot(x3,y3,'ob'); 
plot(x4,y4,'or'); 
grid on 
hold off

% Зададим цели наших четырех кластеров 
T1(1:30)=10; 
T2(1:30)=20; 
T3(1:30)=30; 
T4(1:30)=40; 
% Соединим все цели кластеров 
T(1:30)=T1; 
T(31:60)=T2; 
T(61:90)=T3; 
T(91:120)=T4; 
% Соединим всю базу знаний в переменной z 
x(1:30)=x1; 
x(31:60)=x2; 
x(61:90)=x3; 
x(91:120)=x4; 
y(1:30)=y1; 
y(31:60)=y2; 
y(61:90)=y3; 
y(91:120)=y4; 
z(1,1:120)=x; 
z(2,1:120)=y; 

net = selforgmap([2 2]); 
net = train(net, z);

testPoints = [0 1 -1;1 -1 -1];

a = sim(net,testPoints);
disp(a)